---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutoutNotCuttingAnything
source: html/1f2ccfac-63f3-0f31-1656-cd168851e590.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutoutNotCuttingAnything Property

Opening not cutting anything.

## Syntax (C#)
```csharp
public static FailureDefinitionId CutoutNotCuttingAnything { get; }
```